; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	spectrograph0 - mode
	image3 - mode
	image2 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 168)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 130)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 121)
	(= (data Phenomenon3 spectrograph0) 169)
	(= (data Phenomenon4 spectrograph0) 62)
	(= (data Phenomenon5 spectrograph0) 52)
	(= (data Star6 spectrograph0) 134)
	(= (data Phenomenon7 spectrograph0) 40)
	(= (data Phenomenon8 spectrograph0) 95)
	(= (data Phenomenon9 spectrograph0) 284)
	(= (data Star10 spectrograph0) 30)
	(= (data Phenomenon3 image3) 171)
	(= (data Phenomenon4 image3) 200)
	(= (data Phenomenon5 image3) 13)
	(= (data Star6 image3) 155)
	(= (data Phenomenon7 image3) 111)
	(= (data Phenomenon8 image3) 245)
	(= (data Phenomenon9 image3) 13)
	(= (data Star10 image3) 14)
	(= (data Phenomenon3 image2) 264)
	(= (data Phenomenon4 image2) 75)
	(= (data Phenomenon5 image2) 142)
	(= (data Star6 image2) 204)
	(= (data Phenomenon7 image2) 112)
	(= (data Phenomenon8 image2) 239)
	(= (data Phenomenon9 image2) 146)
	(= (data Star10 image2) 27)
	(= (data Phenomenon3 infrared1) 41)
	(= (data Phenomenon4 infrared1) 2)
	(= (data Phenomenon5 infrared1) 28)
	(= (data Star6 infrared1) 229)
	(= (data Phenomenon7 infrared1) 281)
	(= (data Phenomenon8 infrared1) 165)
	(= (data Phenomenon9 infrared1) 159)
	(= (data Star10 infrared1) 205)
	(= (slew_time GroundStation1 Star0) 41.88)
	(= (slew_time Star0 GroundStation1) 41.88)
	(= (slew_time Star2 Star0) 66.46)
	(= (slew_time Star0 Star2) 66.46)
	(= (slew_time Star2 GroundStation1) 45.66)
	(= (slew_time GroundStation1 Star2) 45.66)
	(= (slew_time Phenomenon3 Star0) 31.87)
	(= (slew_time Star0 Phenomenon3) 31.87)
	(= (slew_time Phenomenon3 GroundStation1) 83.61)
	(= (slew_time GroundStation1 Phenomenon3) 83.61)
	(= (slew_time Phenomenon3 Star2) 21.63)
	(= (slew_time Star2 Phenomenon3) 21.63)
	(= (slew_time Phenomenon4 Star0) 31.44)
	(= (slew_time Star0 Phenomenon4) 31.44)
	(= (slew_time Phenomenon4 GroundStation1) 9.831)
	(= (slew_time GroundStation1 Phenomenon4) 9.831)
	(= (slew_time Phenomenon4 Star2) 67.45)
	(= (slew_time Star2 Phenomenon4) 67.45)
	(= (slew_time Phenomenon4 Phenomenon3) 4.864)
	(= (slew_time Phenomenon3 Phenomenon4) 4.864)
	(= (slew_time Phenomenon5 Star0) 69.08)
	(= (slew_time Star0 Phenomenon5) 69.08)
	(= (slew_time Phenomenon5 GroundStation1) 58.02)
	(= (slew_time GroundStation1 Phenomenon5) 58.02)
	(= (slew_time Phenomenon5 Star2) 1.738)
	(= (slew_time Star2 Phenomenon5) 1.738)
	(= (slew_time Phenomenon5 Phenomenon3) 25.79)
	(= (slew_time Phenomenon3 Phenomenon5) 25.79)
	(= (slew_time Phenomenon5 Phenomenon4) 39.55)
	(= (slew_time Phenomenon4 Phenomenon5) 39.55)
	(= (slew_time Star6 Star0) 62.17)
	(= (slew_time Star0 Star6) 62.17)
	(= (slew_time Star6 GroundStation1) 10.86)
	(= (slew_time GroundStation1 Star6) 10.86)
	(= (slew_time Star6 Star2) 6.049)
	(= (slew_time Star2 Star6) 6.049)
	(= (slew_time Star6 Phenomenon3) 10.56)
	(= (slew_time Phenomenon3 Star6) 10.56)
	(= (slew_time Star6 Phenomenon4) 21.88)
	(= (slew_time Phenomenon4 Star6) 21.88)
	(= (slew_time Star6 Phenomenon5) 23.09)
	(= (slew_time Phenomenon5 Star6) 23.09)
	(= (slew_time Phenomenon7 Star0) 62.93)
	(= (slew_time Star0 Phenomenon7) 62.93)
	(= (slew_time Phenomenon7 GroundStation1) 47.73)
	(= (slew_time GroundStation1 Phenomenon7) 47.73)
	(= (slew_time Phenomenon7 Star2) 20.15)
	(= (slew_time Star2 Phenomenon7) 20.15)
	(= (slew_time Phenomenon7 Phenomenon3) 24.75)
	(= (slew_time Phenomenon3 Phenomenon7) 24.75)
	(= (slew_time Phenomenon7 Phenomenon4) 40.19)
	(= (slew_time Phenomenon4 Phenomenon7) 40.19)
	(= (slew_time Phenomenon7 Phenomenon5) 5.708)
	(= (slew_time Phenomenon5 Phenomenon7) 5.708)
	(= (slew_time Phenomenon7 Star6) 21.48)
	(= (slew_time Star6 Phenomenon7) 21.48)
	(= (slew_time Phenomenon8 Star0) 36.57)
	(= (slew_time Star0 Phenomenon8) 36.57)
	(= (slew_time Phenomenon8 GroundStation1) 3.254)
	(= (slew_time GroundStation1 Phenomenon8) 3.254)
	(= (slew_time Phenomenon8 Star2) 15.38)
	(= (slew_time Star2 Phenomenon8) 15.38)
	(= (slew_time Phenomenon8 Phenomenon3) 51.6)
	(= (slew_time Phenomenon3 Phenomenon8) 51.6)
	(= (slew_time Phenomenon8 Phenomenon4) 8.035)
	(= (slew_time Phenomenon4 Phenomenon8) 8.035)
	(= (slew_time Phenomenon8 Phenomenon5) 8.037)
	(= (slew_time Phenomenon5 Phenomenon8) 8.037)
	(= (slew_time Phenomenon8 Star6) 4.073)
	(= (slew_time Star6 Phenomenon8) 4.073)
	(= (slew_time Phenomenon8 Phenomenon7) 65.99)
	(= (slew_time Phenomenon7 Phenomenon8) 65.99)
	(= (slew_time Phenomenon9 Star0) 52.26)
	(= (slew_time Star0 Phenomenon9) 52.26)
	(= (slew_time Phenomenon9 GroundStation1) 6.43)
	(= (slew_time GroundStation1 Phenomenon9) 6.43)
	(= (slew_time Phenomenon9 Star2) 88.88)
	(= (slew_time Star2 Phenomenon9) 88.88)
	(= (slew_time Phenomenon9 Phenomenon3) 10.13)
	(= (slew_time Phenomenon3 Phenomenon9) 10.13)
	(= (slew_time Phenomenon9 Phenomenon4) 14.13)
	(= (slew_time Phenomenon4 Phenomenon9) 14.13)
	(= (slew_time Phenomenon9 Phenomenon5) 31.34)
	(= (slew_time Phenomenon5 Phenomenon9) 31.34)
	(= (slew_time Phenomenon9 Star6) 72.16)
	(= (slew_time Star6 Phenomenon9) 72.16)
	(= (slew_time Phenomenon9 Phenomenon7) 67.27)
	(= (slew_time Phenomenon7 Phenomenon9) 67.27)
	(= (slew_time Phenomenon9 Phenomenon8) 8.937)
	(= (slew_time Phenomenon8 Phenomenon9) 8.937)
	(= (slew_time Star10 Star0) 14.14)
	(= (slew_time Star0 Star10) 14.14)
	(= (slew_time Star10 GroundStation1) 13.83)
	(= (slew_time GroundStation1 Star10) 13.83)
	(= (slew_time Star10 Star2) 56.92)
	(= (slew_time Star2 Star10) 56.92)
	(= (slew_time Star10 Phenomenon3) 16.41)
	(= (slew_time Phenomenon3 Star10) 16.41)
	(= (slew_time Star10 Phenomenon4) 28.96)
	(= (slew_time Phenomenon4 Star10) 28.96)
	(= (slew_time Star10 Phenomenon5) 29.72)
	(= (slew_time Phenomenon5 Star10) 29.72)
	(= (slew_time Star10 Star6) 69.27)
	(= (slew_time Star6 Star10) 69.27)
	(= (slew_time Star10 Phenomenon7) 54.04)
	(= (slew_time Phenomenon7 Star10) 54.04)
	(= (slew_time Star10 Phenomenon8) 57.39)
	(= (slew_time Phenomenon8 Star10) 57.39)
	(= (slew_time Star10 Phenomenon9) 80.34)
	(= (slew_time Phenomenon9 Star10) 80.34)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Phenomenon5)
	(pointing satellite2 Phenomenon8)
	(have_image Phenomenon3 spectrograph0)
	(have_image Phenomenon4 infrared1)
	(have_image Phenomenon5 image3)
	(have_image Star6 image3)
	(have_image Phenomenon8 image2)
	(have_image Phenomenon9 image3)
	(have_image Star10 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 168 to 126.12, (fuel-used) from 0 to 41.88
   goals met: 2 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 10
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 10
4. (turn_to satellite0 phenomenon3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 126.12 to 94.25, (fuel-used) from 41.88 to 73.75
   goals met: 2 of 10
5. (turn_to satellite1 groundstation1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 130 to 71.98, (fuel-used) from 73.75 to 131.77
   goals met: 1 of 10
6. (take_image satellite0 phenomenon3 instrument0 spectrograph0)
   added: (have_image phenomenon3 spectrograph0)
   changed: (data_capacity satellite0) from 1000 to 831, (data-stored) from 0 to 169
   goals met: 2 of 10
7. (turn_to satellite0 star6 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 94.25 to 83.69, (fuel-used) from 131.77 to 142.33
   goals met: 2 of 10
8. (take_image satellite0 star6 instrument0 image3)
   added: (have_image star6 image3)
   changed: (data_capacity satellite0) from 831 to 676, (data-stored) from 169 to 324
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 83.69 to 79.617, (fuel-used) from 142.33 to 146.403
   goals met: 3 of 10
10. (turn_to satellite1 phenomenon8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 71.98 to 68.726, (fuel-used) from 146.403 to 149.657
   goals met: 3 of 10
11. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 79.617 to 71.58, (fuel-used) from 149.657 to 157.694
   goals met: 3 of 10
12. (take_image satellite0 phenomenon5 instrument0 image3)
   added: (have_image phenomenon5 image3)
   changed: (data_capacity satellite0) from 676 to 663, (data-stored) from 324 to 337
   goals met: 4 of 10
13. (turn_to satellite0 star2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 71.58 to 69.842, (fuel-used) from 157.694 to 159.432
   goals met: 5 of 10
14. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 68.726 to 60.689, (fuel-used) from 159.432 to 167.469
   goals met: 6 of 10
15. (turn_to satellite1 phenomenon8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 60.689 to 52.652, (fuel-used) from 167.469 to 175.506
   goals met: 5 of 10
16. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 5 of 10
17. (turn_to satellite0 phenomenon5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 69.842 to 68.104, (fuel-used) from 175.506 to 177.244
   goals met: 4 of 10
18. (turn_to satellite0 star2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 68.104 to 66.366, (fuel-used) from 177.244 to 178.982
   goals met: 5 of 10
19. (turn_to satellite0 phenomenon8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 66.366 to 50.986, (fuel-used) from 178.982 to 194.362
   goals met: 4 of 10
20. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 50.986 to 42.049, (fuel-used) from 194.362 to 203.299
   goals met: 4 of 10
21. (take_image satellite0 phenomenon9 instrument0 image3)
   added: (have_image phenomenon9 image3)
   changed: (data_capacity satellite0) from 663 to 650, (data-stored) from 337 to 350
   goals met: 5 of 10
22. (turn_to satellite0 phenomenon5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 42.049 to 10.709, (fuel-used) from 203.299 to 234.639
   goals met: 5 of 10
23. (turn_to satellite0 star2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 10.709 to 8.971, (fuel-used) from 234.639 to 236.377
   goals met: 6 of 10
24. (turn_to satellite1 groundstation1 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 52.652 to 49.398, (fuel-used) from 236.377 to 239.631
   goals met: 6 of 10
25. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 6 of 10
26. (turn_to satellite1 phenomenon8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 49.398 to 46.144, (fuel-used) from 239.631 to 242.885
   goals met: 6 of 10
27. (take_image satellite1 phenomenon8 instrument1 image2)
   added: (have_image phenomenon8 image2)
   changed: (data_capacity satellite1) from 1000 to 761, (data-stored) from 350 to 589
   goals met: 7 of 10
28. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 46.144 to 38.107, (fuel-used) from 242.885 to 250.922
   goals met: 8 of 10
29. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 8 of 10
30. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 8 of 10
31. (turn_to satellite1 star2 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 38.107 to 36.369, (fuel-used) from 250.922 to 252.66
   goals met: 7 of 10
32. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 7 of 10
33. (turn_to satellite1 phenomenon5 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 36.369 to 34.631, (fuel-used) from 252.66 to 254.398
   goals met: 8 of 10
34. (turn_to satellite1 phenomenon8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 34.631 to 26.594, (fuel-used) from 254.398 to 262.435
   goals met: 7 of 10
35. (turn_to satellite1 phenomenon4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 26.594 to 18.559, (fuel-used) from 262.435 to 270.47
   goals met: 7 of 10
36. (take_image satellite1 phenomenon4 instrument2 infrared1)
   added: (have_image phenomenon4 infrared1)
   changed: (data_capacity satellite1) from 761 to 759, (data-stored) from 589 to 591
   goals met: 8 of 10
37. (turn_to satellite1 phenomenon8 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 18.559 to 10.524, (fuel-used) from 270.47 to 278.505
   goals met: 8 of 10
38. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 10.524 to 2.487, (fuel-used) from 278.505 to 286.542
   goals met: 9 of 10
39. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 9 of 10
40. (turn_to satellite2 groundstation1 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 121 to 117.746, (fuel-used) from 286.542 to 289.796
   goals met: 8 of 10
41. (turn_to satellite2 star10 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star10)
   changed: (fuel satellite2) from 117.746 to 103.916, (fuel-used) from 289.796 to 303.626
   goals met: 8 of 10
42. (turn_to satellite2 groundstation1 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 103.916 to 90.086, (fuel-used) from 303.626 to 317.456
   goals met: 8 of 10
43. (turn_to satellite2 star10 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star10)
   changed: (fuel satellite2) from 90.086 to 76.256, (fuel-used) from 317.456 to 331.286
   goals met: 8 of 10
44. (turn_to satellite2 star0 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 76.256 to 62.116, (fuel-used) from 331.286 to 345.426
   goals met: 8 of 10
45. (turn_to satellite2 star10 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star10)
   changed: (fuel satellite2) from 62.116 to 47.976, (fuel-used) from 345.426 to 359.566
   goals met: 8 of 10
46. (turn_to satellite2 star0 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 47.976 to 33.836, (fuel-used) from 359.566 to 373.706
   goals met: 8 of 10
47. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 8 of 10
48. (turn_to satellite2 star10 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star10)
   changed: (fuel satellite2) from 33.836 to 19.696, (fuel-used) from 373.706 to 387.846
   goals met: 8 of 10
49. (take_image satellite2 star10 instrument3 infrared1)
   added: (have_image star10 infrared1)
   changed: (data_capacity satellite2) from 1000 to 795, (data-stored) from 591 to 796
   goals met: 9 of 10
50. (turn_to satellite2 groundstation1 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 19.696 to 5.866, (fuel-used) from 387.846 to 401.676
   goals met: 9 of 10
51. (turn_to satellite2 phenomenon8 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 5.866 to 2.612, (fuel-used) from 401.676 to 404.93
   goals met: 10 of 10
